In [363]:
import numpy as np
import pandas as pd

In [364]:
data_dic={
    'col_1':[1,2,3,4,5],
    'col_2':[111,222,333,111,555],
    'col_3':['alpha','bravo','charlie',np.nan,np.nan]
}
df=pd.DataFrame(data_dic,index=[1,2,3,4,5])
df

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [365]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   5 non-null      int64
 1   col_2   5 non-null      int64
 2   col_3   3 non-null      object
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

In [366]:
df.head(2)

   col_1  col_2  col_3
1      1    111  alpha
2      2    222  bravo

In [367]:
df.isnull()

   col_1  col_2  col_3
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True

In [368]:
print(df.dropna(axis=0)) #axis 0 deletes the rows , and drop na looks for nan values to delete the rows i.e 2 rows
print(df.dropna(axis=1))  #axis 0 deletes the columns , and drop na looks for nan values to delete the columns

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
   col_1  col_2
1      1    111
2      2    222
3      3    333
4      4    111
5      5    555

In [369]:
print(df.fillna(value='xyz'))#replaceing the nan values with xyz string
print(df.fillna(method='ffill')) #forward filling

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      xyz
5      5    555      xyz
   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111  charlie
5      5    555  charlie

In [370]:
print(df['col_1'].unique())
print(df['col_2'].unique())
print(df['col_3'].unique())
#111 and nan are repeated values so returns only once

[1 2 3 4 5]
[111 222 333 555]
['alpha' 'bravo' 'charlie' nan]

In [371]:
print(df['col_1'].nunique())
print(df['col_2'].nunique())
print(df['col_3'].nunique())

5
4
3

In [372]:
print(df['col_1'].value_counts())
print(df['col_2'].value_counts())
print(df['col_3'].value_counts())

col_1
1    1
2    1
3    1
4    1
5    1
Name: count, dtype: int64
col_2
111    2
222    1
333    1
555    1
Name: count, dtype: int64
col_3
alpha      1
bravo      1
charlie    1
Name: count, dtype: int64

In [373]:
df.sort_values(by='col_2') #sorts the columns by using the columns

   col_1  col_2    col_3
1      1    111    alpha
4      4    111      NaN
2      2    222    bravo
3      3    333  charlie
5      5    555      NaN

In [374]:
df.sort_values(by='col_3') #sorts column 3 and the prints table

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [375]:
df['col_1']>2 #boolen series

1    False
2    False
3     True
4     True
5     True
Name: col_1, dtype: bool

In [376]:
df['col_2']

1    111
2    222
3    333
4    111
5    555
Name: col_2, dtype: int64

In [377]:
# we can say, this is a boolean mask oon said conditob=n to the dataframe ,df, for filtering out results
bool_ser=(df['col_1']>2) & (df['col_2']==111)
bool_ser

1    False
2    False
3    False
4     True
5    False
dtype: bool

In [378]:
result=df[bool_ser]
result

   col_1  col_2 col_3
4      4    111   NaN

In [379]:
def square(value):
    return value**2
#our customized or user defined fuction to find the square

In [380]:
df['col_1'].apply(square)

1     1
2     4
3     9
4    16
5    25
Name: col_1, dtype: int64

In [381]:
df['col_1'].apply(lambda value:value*2)

1     2
2     4
3     6
4     8
5    10
Name: col_1, dtype: int64

In [382]:
df['col_3'][0:3].apply(len)

#object type of float doesnt have len

1    5
2    5
3    7
Name: col_3, dtype: int64

In [383]:
type(np.nan)

float

In [384]:
df.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [385]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [386]:
#deleting rows (axis=0) or column (axis=1)
print(df.drop('col_1',axis=1))
print(df)

   col_2    col_3
1    111    alpha
2    222    bravo
3    333  charlie
4    111      NaN
5    555      NaN
   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [387]:
newdf=df.copy()
#creating a copy

print(newdf)

del newdf['col_1']
newdf

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

   col_2    col_3
1    111    alpha
2    222    bravo
3    333  charlie
4    111      NaN
5    555      NaN

In [388]:
df.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [ ]:
df.pivot_tables((values='col_2',index='col_1',colums=['col_3'])